---
kind: type
id: T:Autodesk.Revit.DB.DWGImportOptions
source: html/fcba2c30-7e6d-9ab7-8378-f4c6d5de06bf.htm
---
# Autodesk.Revit.DB.DWGImportOptions

The import options used by importing DWG or DXF format file.

## Syntax (C#)
```csharp
public class DWGImportOptions : BaseImportOptions
```